import HomeLayout from "../components/HomeLayout";

export default function Home() {
  return (
    <HomeLayout
    children = {
      <>
      <h2 className="text-xl font-bold mb-2">Шановні панове!</h2>
      <p className="mb-2">
        Вам пропонується система on-line замовлення, призначена для оперативного і конфіденційного отримання від Вас заявки на наш товар. Ця система дозволяє переглянути весь асортимент пропонованого товару, вибрати позиції, що Вас цікавлять, в потрібній для Вас кількості і відправити заявку нашому співробітнику для оформлення відвантаження.
      </p>
      <p className="font-bold mb-2">
        Як зробити онлайн-замовлення.
      </p>
      <p className="mb-2">
        Для початку роботи з on-line замовленням, Вам необхідно заповнити реєстраційну форму, всі поля якої обов'язкові для заповнення. Логін і пароль виберіть для себе самостійно. Обмежень по символах немає. Пройшовши реєстрацію, в подальшому, Вам буде необхідно тільки підтвердити логін і пароль для доступу до форми замовлення.
      </p>
      <p className="mb-2">
        У формі замовлення Ви потрапляєте в довідник товару. Для більш зручного перегляду, весь товар розбитий на групи. У верхній частині екрану, у випадаючому списку, Ви вибираєте групу, яка Вас цікавить. Вибравши потрібну групу, натискаєте кнопку «Знайти» і отримуєте, в нижній частині екрану, весь список товарів даної групи. Навпроти кожного найменування товару знаходиться поле введення.
      </p>
      <p className="mb-2">
        У нього вводиться кількість товару, що Вас цікавить. Переглянувши весь список і ввівши обрану кількість, опускаєтеся в самий низ списку товару, поки не з'явиться кнопка вибору «Вибрати». Натиснувши її, весь обраний товар з даного списку запам'ятається (це можна замінити простим натисканням клавіші Enter під час знаходження курсору в полі введення). Далі Ви можете вибрати іншу групу товару і виконати всі вищезазначені дії.
      </p>
      <p className="mb-2">
        Закінчивши вибірку товару, Ви можете переглянути вибрані позиції кнопкою «Вміст замовлення». У формі, що з'являється, міститься інформація про вибрані Вами позиції, кількість, ціни і вагу товару. Також присутні загальна вага і вартість всього замовлення. Якщо необхідно, Ви можете відредагувати кількість товару в кожній вибраній Вами товарній позиції або додати товарну позицію. Після внесення змін в замовлення необхідно натиснути кнопку «Перерахувати». Підтвердження успішного відправлення форми замовлення Ви побачите на своєму моніторі.
      </p>
      <p className="mb-2">
        Дякуємо за надану увагу і довіру до нашої фірми. Сподіваємося, що така форма роботи збереже Ваш час і принесе задоволення.
      </p>
      </>
    }
    />
  );
}